import { Link } from 'react-router-dom';
import styles from './Footer.module.scss';

const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className={styles.contentContainer}>
        <div className={styles.columns}>
          <div className={styles.column}>
            <h2>
              <Link to="/introduction">Введение в ядерную медицину</Link>
            </h2>

            <ul>
              <li>
                <Link to="/articles">Научно-популярные статьи</Link>
              </li>

              <li>
                <Link to="/video-lectures">Видеолекции</Link>
              </li>

              <li>
                <Link to="/podcasts">Подкасты</Link>
              </li>

              <li>
                <Link to="/equipment">Оборудование ядерной медицины</Link>
              </li>
            </ul>
          </div>

          <div className={styles.column}>
            <h2>
              <Link to="/knowledge">База знаний</Link>
            </h2>

            <ul>
              <li>
                <Link to="/diagnostics">Диагностика</Link>
              </li>

              <li>Терапия</li>

              <li>Радионуклиды</li>

              <li>Нормативные документы</li>
            </ul>
          </div>

          <div className={styles.column}>
            <h2>Практикум</h2>

            <ul>
              <li>VR тренажеры ИФИБ</li>

              <li>GATE</li>

              <li>Системы планирования</li>

              <li>БиоПлак</li>

              <li>Анализ снимков</li>

              <li>Реанимационный монитор</li>
            </ul>
          </div>

          <div className={styles.column}>
            <h2>Квесты</h2>

            <ul>
              <li>Выбрать квест</li>

              <li>Рейтинг пользователей</li>
            </ul>
          </div>
        </div>

        <div className={styles.footerBottom}>
          <div className={styles.socialIcons}>
            <a
              href="https://vk.com/physbio_mephi"
              target="_blank"
              className={styles.iconButton}
              rel="noreferrer"
            >
              <svg
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M1.68 1.68C3.17891e-07 3.376 0 6.088 0 11.52V12.48C0 17.904 3.17891e-07 20.616 1.68 22.32C3.376 24 6.088 24 11.52 24H12.48C17.904 24 20.616 24 22.32 22.32C24 20.624 24 17.912 24 12.48V11.52C24 6.096 24 3.384 22.32 1.68C20.624 3.17891e-07 17.912 0 12.48 0H11.52C6.096 0 3.384 3.17891e-07 1.68 1.68ZM4.048 7.304H6.8C6.888 11.88 8.904 13.816 10.504 14.216V7.304H13.088V11.248C14.664 11.08 16.328 9.28 16.888 7.296H19.464C19.254 8.32304 18.8345 9.29574 18.2316 10.1533C17.6287 11.0109 16.8554 11.7348 15.96 12.28C16.9592 12.7772 17.8417 13.4806 18.5491 14.3438C19.2566 15.2071 19.7729 16.2105 20.064 17.288H17.224C16.616 15.392 15.096 13.92 13.088 13.72V17.288H12.768C7.296 17.288 4.176 13.544 4.048 7.304Z"
                  fill="white"
                />
              </svg>
            </a>

            <a
              href="https://t.me/s/physbio_mephi"
              target="_blank"
              className={styles.iconButton}
              rel="noreferrer"
            >
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M28 16C28 19.1826 26.7357 22.2348 24.4853 24.4853C22.2348 26.7357 19.1826 28 16 28C12.8174 28 9.76516 26.7357 7.51472 24.4853C5.26428 22.2348 4 19.1826 4 16C4 12.8174 5.26428 9.76516 7.51472 7.51472C9.76516 5.26428 12.8174 4 16 4C19.1826 4 22.2348 5.26428 24.4853 7.51472C26.7357 9.76516 28 12.8174 28 16ZM16.4305 12.859C15.2625 13.345 12.9295 14.35 9.4315 15.874C8.8645 16.099 8.567 16.32 8.539 16.537C8.494 16.9015 8.9515 17.0455 9.574 17.242L9.8365 17.3245C10.4485 17.524 11.2735 17.7565 11.701 17.7655C12.091 17.7755 12.525 17.6155 13.003 17.2855C16.272 15.0795 17.959 13.9645 18.064 13.9405C18.139 13.9225 18.244 13.9015 18.313 13.9645C18.382 14.0275 18.376 14.1445 18.3685 14.176C18.3235 14.3695 16.528 16.0375 15.5995 16.9015C15.31 17.1715 15.1045 17.362 15.0625 17.4055C14.97 17.5 14.876 17.5931 14.7805 17.6845C14.2105 18.2335 13.7845 18.6445 14.803 19.3165C15.2935 19.6405 15.6865 19.906 16.078 20.173C16.504 20.464 16.93 20.7535 17.482 21.1165C17.622 21.2085 17.757 21.302 17.887 21.397C18.3835 21.751 18.832 22.069 19.3825 22.018C19.7035 21.988 20.035 21.688 20.203 20.788C20.6005 18.6625 21.382 14.059 21.562 12.1615C21.5733 12.0038 21.5668 11.8453 21.5425 11.689C21.528 11.563 21.467 11.447 21.3715 11.3635C21.2348 11.2697 21.0723 11.2209 20.9065 11.224C20.4565 11.2315 19.762 11.473 16.4305 12.859Z"
                  fill="white"
                />
              </svg>
            </a>

            <a
              href="https://www.youtube.com/channel/UCYv3q7GQdP0dZ7k7DooNbWw"
              target="_blank"
              className={styles.iconButton}
              rel="noreferrer"
            >
              <svg
                width="28"
                height="22"
                viewBox="0 0 28 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M14.3253 0.333374C15.0373 0.337374 16.8187 0.354707 18.712 0.430707L19.384 0.46004C21.2893 0.549374 23.1933 0.704041 24.1387 0.966707C25.3987 1.32137 26.388 2.35337 26.7227 3.66271C27.256 5.74271 27.3227 9.79871 27.3307 10.7814L27.332 10.984V11.216C27.3227 12.1987 27.256 16.256 26.7227 18.3347C26.384 19.648 25.3933 20.6814 24.1387 21.0307C23.1933 21.2934 21.2893 21.448 19.384 21.5374L18.712 21.568C16.8187 21.6427 15.0373 21.6614 14.3253 21.664L14.012 21.6654H13.672C12.1653 21.656 5.864 21.588 3.85866 21.0307C2.6 20.676 1.60933 19.644 1.27466 18.3347C0.741331 16.2547 0.674664 12.1987 0.666664 11.216V10.7814C0.674664 9.79871 0.741331 5.74137 1.27466 3.66271C1.61333 2.34937 2.604 1.31604 3.86 0.96804C5.864 0.409374 12.1667 0.341374 13.6733 0.333374H14.3253ZM11.332 6.33337V15.6667L19.332 11L11.332 6.33337Z"
                  fill="white"
                />
              </svg>
            </a>
          </div>

          <div className={styles.footerText}>
            <p>
              Национальный исследовательский ядерный университет «МИФИ»,
              Институт физики и инженерии биомедицинских систем
            </p>

            <p>115409, Российская Федерация, г. Москва, Каширское ш., 31</p>

            <p>Политика конфиденциальности и обработки персональных данных</p>

            <p>© 2024 — ИФИБ НИЯУ МИФИ</p>
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
